package Homework;

/* Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника*/

public class Task07 {

	public static void main(String[] args) {
			
		float length = 13;
		float width = length / 2;
		
		float square = length * width;
		
		System.out.println("Площадь прямоугольника равна " + square);

	}

}
